class UsageTipsMessages {
  static final List<Map<String, dynamic>> messages = [
    {
      'message':
          'تم إعداد هذه المعلومات لتقديم إرشادات عامة فقط، ولا يُقصد منها أن تكون بديلاً عن المشورة المتخصصة. يُرجى التحقق من التفاصيل والتأكد من مطابقتها لاحتياجاتك الخاصة قبل اتخاذ أي قرارات بناءً عليها.',
      'storageKey': 'feasibilityStudyDialog',
    },
    {
      'message':
          'هذة الاداة تساعدك علي حساب المساحة المطلوبة لكل عمر \n\n يجب تقسيم العنبر في يوم استقبال الكتاكيت ثم التوسيع تدريجيا لحين تاخذ الفراخ العنبر بالكامل \n\n المساحة المعروضة يجب ان تكون المساحة المخصصة للفراخ فقط دون اماكن تخزين احتياجات الدورة \n\n اذا اردت معرفة عدد الفراخ التي يمكن للعنبر الخاص بك ان يحتويها اضرب مساحة العنبر في 10',
      'storageKey': 'chickenDensityDialog',
    },
  ];
}
