import '../../widget/ad/banner/ad_all_banner.dart';
import 'package:farkha_app/view/widget/drawer/arrow_back/arrow_back.dart';
import 'package:farkha_app/view/widget/drawer/divider_drawer.dart';
import 'package:farkha_app/view/widget/drawer/text_drawer/title_drawer.dart';
import 'package:farkha_app/view/widget/drawer/text_drawer/type_drawer.dart';
import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:google_mobile_ads/google_mobile_ads.dart';

class A3ard extends StatelessWidget {
  const A3ard({super.key});

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        body: SingleChildScrollView(
          child: Column(
            children: [
              const ArrowBack(),
              Container(
                  width: double.infinity,
                  padding: const EdgeInsets.all(20),
                  child: Column(children: [
                    const TitleDrawer(title: 'الماريك'),
                    TypeDrawer(
                      type:
                          'تظهر أعراض المرض في شكل بطء في النمو مع شلل في الأرجل والأجنحة حيث يمشى الطائر بطريقه غير طبيعيه ثم يفقد بعد ذلك السيطرة على أرجله التي يحدث بها عرج ثم تلتوي أصابع الرجل مع تقوس مفصل الركبة وضمور عضلات الفخذ مع ظهور إسهال مائي مصفر اللون ذو رائحة كريهة مع عدم قدره الطائر على الحركة للوصول إلى المعالف والمساقي مما يحدث هزال شديد لهذه الطيور نتيجة للجوع والعطش وتموت كما انه قد تظهر الإصابة أحيانا في العين بتغير لونها إلى الرمادي مع اختفاء الخطوط الإشاعيه وتشوه القزاحيه وتقل قدرتها على الاستجابة للضوء وتضيق تدريجيا وقد يصاب الطائر بالعمى.',
                    ),
                    const DividerDrawer(),
                    const TitleDrawer(title: 'النيوكاسل'),
                    TypeDrawer(
                      type:
                          'تظهر الأعراض على الطائر في البداية كأعراض تنفسيه حيث يفتح الطائر فمه مع رقبته ليحصل على أكبر قدر من الهواء مما يؤدى لسماع أصوات حشرجة نتيجة لدخول الهواء في القصبة الهوائية وتزداد تلك الحالة ليلا ينبع ذلك حدوث إسهال للطائر يكون أخضر اللون ممتزجا بالإفرازات الجيرية البيضاء ويتحول لون العرف والدلايات إلى اللون الأحمر الداكن أو الأزرق مع حدوث عسر للهضم وبقاء الغذاء في الحوصلة ممتزجا بسائل بني اللون رائحته حمضيه كريهة مع نزول لعاب بكميات كبيره من الفم مع فقد الشهية للطعام والشراب ثم تحدث بعد ذلك الأعراض العصبية مثل الارتعاش العنيف وشلل الأطراف وانثناء الرقبة لأعلى أو أسفل وعدم التوازن والطيران في الهواء ثم الوقوع على الأرض بشده ثم يموت الطائر . وفي حالة الطيور البالغة يحدث انخفاض واضح في إنتاج البيض يتراوح مابين 20 -50% وقد يتوقف تماما مع إنتاج بيض قشرة ( برشت ) أو تكون القشرة ضعيفة وهشة.',
                    ),
                    const DividerDrawer(),
                    const TitleDrawer(title: 'الالتهاب الشعبي المعدي'),
                    TypeDrawer(
                      type:
                          'تظهر  الأعراض في صوره إفرازات مخاطية من الأنف والعين وتورم الجيوب الأنفية مصحوبة بسعال وعطس وحشرجة عاليه في الصوت مع مد الطائر رقبته إلى الأمام ليتمكن من التخلص من السوائل المتجمعة في المسالك التنفسية كذلك يحدث انخفاض في استهلاك العلف مع نقص شديد في الوزن يصاحبه انخفاض في إنتاج البيض مع التأثير على نوعيه القشرة كأن تلين وتكون رقيقه وتتشوه وتتعرج ويعمل على زيادة هذه الأغراض عوامل الإجهاد مثل الظروف المناخية والإدارة والتغذية الرديئة ونقل الطيور من عنبر إلى أخر وعمليات التحصين.',
                    ),
                    const DividerDrawer(),
                    const TitleDrawer(title: 'الجامبورو'),
                    TypeDrawer(
                      type:
                          'تظهر الأعراض فجأة بالقطيع وتنتشر بسرعة كبيرة في صورة خمول وكسل عام للطائر مع عدم الرغبة في الحركة مع رقاد الطائر وامتناعه عن الأكل والشرب مع حدوث إسهال مائي مصفر رغوي مع أبتلال ريش نطقه المجمع مع التهابها مما يحفز الطيور على نقر تلك المنطقة ونسبه الطيور المريضة تكون مرتفعة حيث تتراوح نسبه النفوق مابين 10 - 30 % تكون أعلى نسبه نفوق في اليوم الثالث من ظهور المرض ثم تنخفض بعد ذلك في خلال خمسة أيام.',
                    ),
                    const DividerDrawer(),
                    const TitleDrawer(title: 'الجدري'),
                    TypeDrawer(
                      type:
                          'تظهر أعراض هذا المرض في الدجاج في صوره بثور على العرف والدلايات وقد تمتد إلى باقي الأجزاء الغير مغطاة بالريش والبثور يكون لونها بني غامق ومرتفعه عن سطح الجلد وعند إزالتها تترك مكانها منطقه مدممه وقد تصاب الأنف والفم مما يعيق التنفس والأكل وأيضا قد يصيب جفون العين مما يؤدى إلى إعاقة النظر أو العمى . ويصيب مرض الجدري عاده الطيور البالغة ( 5 - 12 شهر من العمر ) ويسبب انخفاض واضح في إنتاج البيض.',
                    ),
                  ]))
            ],
          ),
        ),
        bottomNavigationBar: AdAllBanner(),
      ),
    );
  }
}
