import '../../widget/ad/banner/ad_all_banner.dart';
import 'package:farkha_app/view/widget/drawer/arrow_back/arrow_back.dart';
import 'package:farkha_app/view/widget/drawer/divider_drawer.dart';
import 'package:farkha_app/view/widget/drawer/text_drawer/title_drawer.dart';
import 'package:farkha_app/view/widget/drawer/text_drawer/type_drawer.dart';
import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:google_mobile_ads/google_mobile_ads.dart';

class Astaqbal extends StatelessWidget {
  const Astaqbal({super.key});

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        body: SingleChildScrollView(
          child: Column(
            children: [
              const ArrowBack(),
              Container(
                  width: double.infinity,
                  padding: const EdgeInsets.all(20),
                  child: Column(children: [
                    TypeDrawer(
                      type:
                          'يشير مصطلح تربية الدواجن إلى تربية أنواع مختلفة من الطيور مثل الدجاج ( الدواجن ) والبط والديك الرومي والأوز والطيور الأخري التى تم تهجينها , والفراخ البيضاء هي أكثر شركات الدواجن شيوعًا. حيث تحتل الفراخ البيضاء وحدها 90٪ من إجمالي الدواجن . وأصبحت تربية الدواجن الآن تحظى بشعبية كبيرة , حيث يتم إعادة تسجيلها كصناعة منظمة وقائمة على أساس علمي مع إمكانات توظيف هائلة. وتربية الدواجن البيضاء  تلعب دورًا مهمًا في الاقتصاد الريفي في مصر .فمن ما لا شك فيه أن مشروع تربية الفراخ البيضاء “الدواجن” هو من أحد أهم مشاريع الانتاج الحيواني على الاطلاق “ان لم يكن أهمها”، ويرجع السبب في ذلك الى الطلب الضخم الذي يصل الى اعلى مستوياته خلال شهر رمضان المفضل ، ولهذا السبب نجد الكثير من مزارع تربية الفراخ في مختلف المناطق الزراعية والريفية، وبكل تأكيد تحقق الكثير من تلك المزارع الكثير من الارباح ، ولكن في المقابل تحقق العديد من تلك المزارع خسائر فادحة بسبب الأمراض التي تؤدي الى مشاكل تربية الفراخ البيضاء عند الاهمال فى التربية .ومده تربيه الدواجن ( الفراخ البيضاء ) من 32 -42 يوم من فتره استلام الكتاكيت الى انتاج اللحم وفي الغالب تكون دورة تربية الدواجن البيضاء (40) يوم وانتاج اللحم فى 32 يوم يكون متوسط الوزن للدجاجه الواحده 1.900 ,وانتاج اللحم فى 42 يوم يكون من 3.500 كيلو الى 4 كيلو تبع نوع الكتكوت والسلاله ونوع العلف المستخدم فى التربية فكلما كان نوع العلف ذو قيمة غذائية اعلي كلما كان وزن الدواجن اكثر وكلما كان نوع الكتكوت افضل كلما كا نسبة مقاومته للامراض افضل, حيث لا يمكن لأي قدر من الإدارة الجيدة تحويل الكتاكيت ذات النوعية الرديئة إلى دواجن تسمين كبيرة الحجم ومربحه حتى ولو كان العلف جيد وذو قيمة غذائية علية.ويطلق لفظ تربيه على تربية الدواجن لأن تربية الدواجن يشبه تربيه الطفل الصغير يجب الاهتمام به حتى ينضج ويعتمد على نفسه.',
                    ),
                    const TitleDrawer(title: 'قبل استقبال الكتاكيت'),
                    TypeDrawer(
                      type:
                          'ازاله الفرشه السابقه واستبدالها بفرشه جديده نظيفه.',
                    ),
                    TypeDrawer(
                      type: 'تنظيف اللمبات وتغير اللمبات غير الصالحه',
                    ),
                    TypeDrawer(
                      type:
                          ' تنظيف أجهزه التبريد والتدفئه ازاله جميع بقايا العلف السابق.',
                    ),
                    TypeDrawer(
                      type:
                          ' اخراج المعالف والمساقى وتنظيفها وتطهيرها وتعريضها لاشاعه الشمس لقتل الامراض.',
                    ),
                    TypeDrawer(
                      type:
                          ' تنظيف أجهزه التهويه ( المراوح , والقنوات الهوائيه , وفتحات التهويه , أجهزه التشغيل.',
                    ),
                    TypeDrawer(
                      type:
                          '  تعقيم المزرعه وذالك بستخدام غاز الفورمالدهيد لقتل الحشرات والفطريات.',
                    ),
                    TypeDrawer(
                      type:
                          ' وضع الحواجز الخاصه بالتحضين أسفل لمبات التدفئه وذالك لتدفئه الكتكوت فى حاله الحظائر الى لاتستخدم التدفئه بالهواء الساخن',
                    ),
                    const DividerDrawer(),
                    const TitleDrawer(title: 'كيفية استقبال الكتاكيت'),
                    TypeDrawer(
                      type:
                          'فرش الارضيه بالنشاره فى الصيف بسمك 5 سم وفى الشتاء 10 سم.',
                    ),
                    TypeDrawer(
                      type:
                          'يوضع العلف البادى بعد وصول الكتاكيت مباشرة واحرص على عدم تجويع الكتاكيت ولو لفتره قصيره .',
                    ),
                    TypeDrawer(
                      type:
                          'يتم توسيع مكان التحضين بحظر بعد اليوم ال15 نظرا لكبر حجم الكتاكيت ومنع التزاحم لان التزاحم يؤدى الى مشاكل كثيره.',
                    ),
                    TypeDrawer(
                      type:
                          'يتم وضع الماء فى السقيات ووضعها داخل مكان التحضين قبل استقبال الكتاكيت ب2 ساعه حتى تاخذ المياه درجه حراره المكان حتى تشرب الكتاكيت مياه دافأه.',
                    ),
                    TypeDrawer(
                      type:
                          'تخصييص 20%من مساحه العنبر فقط لتحضين الكتاكيت ويتم غلق هذه المساحه بستائر سميكه لمنع خروج درجه الحراره خارج مكان التحضين.',
                    ),
                    TypeDrawer(
                      type:
                          'يتم التحضين على درجه حراره 34_35 لمده 3 ايام ثم يتم تقليل درجه الحراره تدريجيا كل يومين درجه حتى نهايه الاسبوع الاول على درجه حراره 31 ثم الاسبوع الثانى تكون درجه الحراره من 31 _الى 29 ثم الاسبوع الثالث من درجه حراره 29 الى 28 ثم الاسبوع الثالث تكون من 28 الى 26 واحرص على عدم نزول درجه الحراره عن 26 حتى لايتم الاصابه بالبرد',
                    ),
                    const DividerDrawer(),
                    const TitleDrawer(title: 'استقبال الكتاكيت عمر يوم'),
                    TypeDrawer(
                      type:
                          'يجب البدء بتربيه كتكوت سليم ذى صفات وراثيه عاليه , ومن قطيع أمهات خاليه من الامراض وخاصه الاسهال الابيض , والتيفود , والميكوبلازما , ولا تقل بيضه التفريخ عن 55جم حتى لانحصل على كتكوت قليل الوزن.',
                    ),
                    TypeDrawer(
                      type:
                          'ولابد أن يكون الكتكوت نشطا ومتجانس الحجم , وكبير , والعيون لامعه , والافضل استبعاد الكتكوت غير ملائم التربيه فى بدايه الامر بل أن يموت أو يستبعد فى فتره أخرى ويخسر المربى العليقه التى أستهلاكها الطائر',
                    ),
                    TypeDrawer(
                      type:
                          'يجب استقاب الكتاكيت عمر يوم على درجة حراره لا تقل عن 34 درجة , حيث يتم وضع الدفايات والمياه والعلف فى العبر أو المزرعة قبل أستقبال الكتاكيت ب 5 ساعات حتى تكون درجه حراره المياه منا سناسبه للكتاكيت فى .',
                    ),
                    TypeDrawer(
                      type:
                          'درجة الحرارة المثلى عند استقبال الكتاكيت هي 33 درجة مئوية خلال الأيام الثلاثة الأولى ويتم تقليل درجة الحراره 2 درجة بعد ثلاثة ايام من الاستقبال لتقف على 32 درجه حتى اليوم العاشر.  ثم تنخفض درجة الحرارة الى 30 درجة مئوية فقط من اليوم العاشر الى اليوم العشرين ثم تخفض درجة الحراره 2 درجة مئوية كل اسبوع حتى تصل إلى 22 درجة مئوية.',
                    ),
                    TypeDrawer(
                      type:
                          'التهوية: - حركة الهواء النقي مهمة للصحة الجيدة والنمو السليم للكتاكيت . حيث تؤدي التهوية السيئة إلى تراكم ثانى أكسيد الكربون والأمونيا وبخار الماء مما قد يؤدي إلى عدوى جرثومية ويؤدى الى مشاكل نحن فى غنا عنها.',
                    ),
                    TypeDrawer(
                      type:
                          'مساحة أرضية المزرعه : - يجب توفير مساحة أرضية كافية للنمو السليم للدجاج. يجب توفير 1 متر مربع لكل 8 دواجن فى فصل الصيف و12 دواجن فى الشتاء. حيث يؤدي ازدحام الدجاج إلى ضعف النمو ويؤدي إلى أفتراس الدواجن واكل ريش بعضهم .',
                    ),
                    TypeDrawer(
                      type:
                          'ارضيات المزرعه: - أرضية مكان التربيه يجب ان تكون مفروشه بطبقات من القش أو قش الأرز أو نشارة الخشب وهذا يسمى فرشه الدواجن . يجب أن يكون سمك الفرشه من 5 إلى 7.5 سم ويجب أن تظل جافه.',
                    ),
                    TypeDrawer(
                      type:
                          ' الضوء: - للحفاظ على الحضنة خالية من الجراثيم المعدية ، يجب أن يكون بيت الحضنة جيد التهوية. تعزز أشعة الشمس الموزعة بالتساوي النمو السليم للطيور وتكوين فيتامين د.',
                    ),
                    TypeDrawer(
                      type:
                          'إسكان الدواجن: - تحظى الدواجن ذات الجوانب المفتوحة بشعبية في بلدنا. الهدف الأساسي من توفير السكن للدواجن هو حمايتها من الشمس والمطر والحيوانات المفترسة وتوفير الراحة. يجب أن يكون بيت الدواجن جيد التهوية. يجب أن تبقى باردة في الصيف ودافئة في الشتاء. يجب أن تكون أرضية بيت الدواجن مقاومة للرطوبة والجرذان وخالية من الشقوق وسهلة التنظيف ومتينة.',
                    ),
                    TypeDrawer(
                      type:
                          'غذية الدواجن: - تعتبر تغذية الطيور الداجنة جزء مهم من التربية. يجب أن يحتوي النظام الغذائي للدجاج على كمية كافية من الماء والكربوهيدرات والبروتينات والدهون والفيتامينات والمعادن. يجب تقديم المواد الغذائية مثل الذرة والشعير والذرة الرفيعة والقمح والفول الصويا وغيرها في المتطلبات القياسية. وهذا يؤدي الى زياده وزن الفراخ البيضاء وتسمينها.',
                    ),
                    TypeDrawer(
                      type:
                          'شراء أفضل الكتاكيت جودة. لا يمكن لأي قدر من الإدارة الجيدة تحويل الكتاكيت ذات النوعية الرديئة إلى طبقات جيدة أو دجاج التسمين. يمكن تحقيق المزيد من الأرباح في الوحدة التجارية عن طريق شراء كتاكيت فارسية عمرها يوم واحد. في وحدات دجاج التسمين ، تعطي الكتاكيت ذات الركض المباشر أداءً جيدًا بنفس القدر',
                    ),
                  ]))
            ],
          ),
        ),
        bottomNavigationBar: AdAllBanner(),
      ),
    );
  }
}
