import 'package:farkha_app/view/widget/drawer/arrow_back/arrow_back.dart';
import 'package:farkha_app/view/widget/drawer/divider_drawer.dart';
import 'package:farkha_app/view/widget/drawer/text_drawer/title_drawer.dart';
import 'package:farkha_app/view/widget/drawer/text_drawer/type_drawer.dart';
import 'package:flutter/material.dart';
import 'package:google_mobile_ads/google_mobile_ads.dart';
import 'package:get/get.dart';
import '../../widget/ad/banner/ad_all_banner.dart';

class Tather extends StatelessWidget {
  const Tather({super.key});

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        body: SingleChildScrollView(
          child: Column(
            children: [
              const ArrowBack(),
              Container(
                  width: double.infinity,
                  padding: const EdgeInsets.all(20),
                  child: Column(children: [
                    TypeDrawer(
                      type:
                          'برنامج تطهير مقترح لتنظيف وتطهير عنبر 500م2 إن تنظيف وتطهير المزرعة جيدا يعتبر أهم العوامل للحصول على نتائج   لذا يجب السماح بفترة كافية(أسبوعين على الأقل) بين انتهاء قطيع واستقبال قطيع جديد.يجب إتباع الإجراءات التالية للحصول على تنظيف وتطهير جيد للعنب',
                    ),
                    TypeDrawer(
                      type:
                          ' رش ملاثيون على الفرشة (2لتر/40 جيدة 0لتر ماء)  وذلك للقضاء على الحشرات والسوس المتواجد بالعنبر فور الإنتهاء من البيع',
                    ),
                    TypeDrawer(
                      type:
                          ' إزالة الفرشة والتخلص منها بعيدا عن المزرعة ويجب عدم نثرها أو تخزينها قريبا من المزرعة',
                    ),
                    TypeDrawer(
                      type:
                          'كنس العنبر وإزالة بقايا السبلة من العنبر وازاله اى بقايا فرشه بالارضيات',
                    ),
                    TypeDrawer(
                      type:
                          'إجراء أعمال الإصلاح والصيانة بالعنبر حيث يتم تفكيك كل الأدوات (المساقى- المعالف - الأطباق البلاستيكية) ونقلها خارج العنبر أو في أحد العنابر وغسلها ثم تطهيرها بمطهر اليود 3%تركيز ثم بالفيروسيد 0.25% ثم تخزينها لحين الاستخدام',
                    ),
                    TypeDrawer(
                      type:
                          'الخزانات وخطوط الماءغسيلها وتطهيرها باستخدام سيد 2000 بمعدل 2% (4لتر/ 200لتر ماء)لإزالة الترسيبات العضوية والغير عضوية ومنع ترسيب الاملاح والشوائب بخطوط العلف ويترك لمده 6ساعات تم غسلها بالماء',
                    ),
                    const DividerDrawer(),
                    const TitleDrawer(
                      title: 'غسيل وتطهير العنبر',
                    ),
                    TypeDrawer(
                      type:
                          'ش العنبر ببادئي النظافه(لإذابة وإزالة البقايا الموجودة بالعنبر مثل زرق الطيور ،الريش، الزغب) بموتور رش رش شمسية لعمل رغاوى على الجدران ويترك لمدة ساعة أو نصف ساعة على الأقل بمادة)بمعدل 10لتر/600لتر ماءMD cid-S(ثم يغسيل العنبر غسيلا جيدا بالماء العادي المندفع تحت ضغط باستخدام ماكينة غسيل أو موتور رش على جميع الأسطح لإزالة بقايا بادئ النظافة ملحوظة هامة:في حالة إصابة القطيع السابق بمرض فيروسي (نيوكاسيل- جمبورو) أو وجود إصابات سابقة بالكلوستريديا أو الكوكسيديا . يتم استخدام صودا كاوية بمعدل 8 كجم/200لتر ماء ساخن ثم رشها على أرضية العنبر.',
                    ),
                    TypeDrawer(
                      type:
                          'طهير العنبر بمطهر قوى مثل فيرو سيد 0.5% (2لتر/400 لتر ماء) رزاز خفيف لتغطية المسطح بالكامل',
                    ),
                    TypeDrawer(
                      type: 'رش العنبر بالكلور 2%',
                    ),
                    TypeDrawer(
                      type:
                          'التطهير بالفنيك 10% للارضيات والجزء السفلى للجدران',
                    ),
                    TypeDrawer(
                      type:
                          'رش العنبر بالفورمالين بمعدل 10% حيث ان الفورمالين بتركيز40%مع تشغيل الهياتر او الدفايات لمده 24ساعة مع غلق العنبر ثم تهويه العنبر لخروج غاز الفورمالدهيد.',
                    ),
                    const TitleDrawer(
                      title: 'بعد جفاف العنبر كليا يتم الأتي:',
                    ),
                    TypeDrawer(
                      type:
                          ' إدخال النشارة وفردها بالكامل إن أمكن أو في مكان التحضين مبدئيا يفضل إدخال كل فرشة العنبر مرة واحدة ليتثنى تطهيرها كاملة قبل وصول الكتاكيتمن مساقى وعلاقات وخلافه إدخال جميع الأدوات الخاصة بالعنبر. رش العنبر فيروسيد 0.25% (500سم/200لتر ماء)او باليود1%. رزاز خفيف طبقة كاملة فوق النشارة والستائر والأدوات والمعدات. غلق العنبر ومنع دخول أي فرد لحين وصول الكتاكيت',
                    ),
                  ]))
            ],
          ),
        ),
        bottomNavigationBar: AdAllBanner(),
      ),
    );
  }
}
