import 'package:flutter_screenutil/flutter_screenutil.dart';
import '../../../widget/ad/native/ad_third_native.dart';
import '../../../widget/app_bar/custom_app_bar.dart';
import '../../../widget/follow_up_tools/articles/text_article/title_article.dart';
import '../../../widget/follow_up_tools/articles/text_article/type_article.dart';
import 'package:flutter/material.dart';
import '../../../widget/ad/banner/ad_third_banner.dart';

class AL3lag extends StatelessWidget {
  const AL3lag({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Column(
        children: [
          const CustomAppBar(
            text: "علاج",
          ),
          Expanded(
            child: SingleChildScrollView(
              child: Padding(
                padding: const EdgeInsets.symmetric(horizontal: 15).r,
                child: const Column(children: [
                  TitleArticle(title: 'الماريك'),
                  TypeArticle(
                    type:
                        'تربيه سلالات من الطيور يكون لها مقدره وراثية عاليه لمقاومه المرض.الاهتمام بتهوية وتطهير العنابر بالفورمالين 3% أو الصودا الكاوية 1% لأنهما يمكنهما القضاء على الفيروس فورا وعدم تربيه أعمار مختلفة من الكتاكيت في نفس المزرعة وأيضا عدم تذبذب درجات الحرارة بالارتفاع والانخفاض مما يسبب للطيور نزلات برد مع العوامل المجهدة الأخرى كنقص التغذية أو الزحام أو سوء التهوية مما يؤدى إلى نفوق مرتفع وعدم الاستفادة من اللقاح المستخدم.التحصين ضد المرض بلقاح الماريك وذلك بإذابة اللقاح في المحاول المذيب المرفق معه والحقن بمعدل 0.2سم / كتكوت في عضله الفخذ أو تحت جلد الرقبة وذلك عند الفقس مباشره.',
                  ),
                  AdThirdNative(),
                  TitleArticle(title: 'النيوكاسل'),
                  TypeArticle(
                    type:
                        'التحصين ضد المرض باللقاح المناسب وفي الأوقات المناسبة يعتبر أهم الإجراءات المتبعة للحماية من المرض وهناك العديد من اللقاحات الحية والميتة ويعد اللقاح عتره هتشنر ب1 وعتره لاسوتا من أهم اللقاحات المستخدمة في مصر وذلك عن طريق الرش أو التغطيس أو مياه الشرب وكذلك استخدام اللقاح الميت بالحقن العضلي للطيور وذلك وفق برنامج التحصين الموجود بنهاية النشرة.العمل على تجنب العوامل المساعدة على إضعاف القطيع مثل الظروف البيئية السيئة كالبرودة أو الحرارة الشديدة والتي تؤثر على حيوية القطيع . كذلك توفير العلائق الغذائية الكاملة المتوازنة في محتواها من العناصر حيث أن عدم اتزان العلائق ونقص كمياتها تؤدى إلى تقليل مقاومه الطائر. كما أن التهوية السيئة تؤدى إلى زيادة الرطوبة وزيادة غاز الأمونيا الذي يسبب أمراض تنفسيه تهيئ من إصابة القطيع.مراعاة الشروط الصحية بالمزرعة مثل تنفيذ برامج التطهير بكل دقه وعناية مع منع دخول الغرباء للمزرعة وعمل برنامج مكافحه للقوارض والكلاب والقطط حيث أنها من العوامل المساعدة على نقل المرض من مزرعة إلى أخرى مع إعدام الطيور النافقة وحرقها ودفنها وعدم إلقائها في العراء.',
                  ),
                  TitleArticle(title: ' الالتهاب الشعبي المعدي'),
                  TypeArticle(
                    type:
                        'إذا ظهر المرض وكان ذلك في فصل الشتاء يتم رفع درجه حرارة العنبر بحوالي 4-5 درجات عن المعدل مع زيادة التهوية به للتخلص من غاز الأمونيا.حقن مضاد حيوي استربتومايسين بمعدل 100-200 ملجم / الطائر أو إضافته كلورتتراسيكلين أو أثرومايسين على العلف بمعدل 200جم / الطن لمدة 7-10 يوم كعلاج أعراض الإصابة بالبكتريا الثانوية.يراعى التحصين للطيور ضد المرض باللقاح الحي ( هـ 120 ) عند عمر 3-4 أسابيع وتكرر عند 4-12 أسبوع أما الجرعة الثالثة فتكون باللقاح الميت عند عمر 14-18 أسبوع مع ملاحظة عدم تأخير التحصين لقرب موعد إنتاج البيض لأن ذلك يعمل على انخفاض إنتاج البيض بشكل ملحوظ.',
                  ),
                  TitleArticle(title: 'الجامبورو'),
                  TypeArticle(
                    type:
                        'نظرا لآن الإصابة بذلك المرض تؤثر على الجهاز المناعي بالجسم مما يتبع ذلك ضعف الاستجابة للقاحات الأخرى للأمراض الأخرى وقابليه الطائر للإصابة بأمراض أخرى لذا فإن الوقاية من هذا المرض تكون بالالتزام بتطبيق برنامج جيد للتطعيم للحصول على أحسن النتائج ويكون ذلك بتلقيح الطيور باللقاح الحي في الأعمار المبكرة وباللقاح الميت لقطيع الأمهات قبل البلوغ.',
                  ),
                  TitleArticle(title: 'الجدري'),
                  TypeArticle(
                    type:
                        'عدم تربيه أعمار مختلفة من الطيور في نفس المزرعة حيث أن العدو بالفيروس من السهل أن تظهر في قطيع صغير في العمر غير محصن إذا حصن قطيع أخر أكبر منه بنفس المزرعة.عدم تربيه أكثر من نوع واحد من الطيور بنفس المزرعة لأن المرض يمكن أن ينتقل بين الأنواع المختلفة.وجد أن التحصين ضد المرض يعتبر الطريقة الوحيدة المضمونة للوقاية من المرض ولكن يراعى الآتي عند التحصين:الوقت الأمثل للتحصين يكون عند عمر 8 -12 أسبوع.يجب عدم تحصين الدجاج البياض لأن ذلك سيؤدى إلى انخفاض إنتاجيه البيض وحدوث القلش للطيور.يجب تحصين المزرعة كلها في وقت واحد وهنا تظهر أهميه تربيه قطعان متقاربة في العمر.يتم إذابة أنبول اللقاح 1000 جرعه في حوالي 25 سم من الماء المقطر مع مراعاة عدم تناثر اللقاح بالمزرعة وإعدام الأمبولات الفارغة بعد الحقن.يتم وخذ جلد الجناح بالإبر المزدوجة المجوفة حيث أنها ابره مجوفة بها شق طولي ليسمح بالتقاط قطره من قطرات اللقاح مع مراعاة غمس إبره بالمحلول بين كل وخزه وأخرى.يتم التحصين للطيور السليمة فقط الغيرلا مريضه بأي مرض وفي الحالة التحصين الناجح يظهر تورم محمر مكان الوخز بعد 7-10 أيام من التحصين وإذا لم يظهر تورم دل ذلك على فساد التحصين ويعاد التحصين مره أخرى.العلاجفي حاله ظهور المرض في قطيع غير محصن يتم تحصينه باللقاح فورا ولكن يجب مراعاة البدء بتحصين الطيور السليمة والانتهاء بالطيور المصابة.عزل الطيور المصابة وإزالة البثور الموجودة في الأماكن المصابة مع دهان مكان البثرة بمحلول يود - جلسرين بنسبه 1-4.يتم تقديم المضادات الحيوية ( تيراميسين أو أرثرومايسين ) بمعدل20 ملجم / الدجاجة لمده 3-5 أيام مع تقديم فيتامين (أ) في مياه الشرب أو حقنها في العضل كعلاج ثانوي للبكتريا ولرفع المناعة.يتم وضع محلول مطهر في ماء الشرب مثل برمنجانات البوتاسيوم 10000:1 أو أحد مركبات الكلور أو اليود خلال فتره المرض ومره كل أسبوع بعد انتهائه.',
                  ),
                ]),
              ),
            ),
          ),
        ],
      ),
      bottomNavigationBar: const AdThirdBanner(),
    );
  }
}
